src/ExternalDataProcessors/Postgres/Postgres.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>Postgres</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>База</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ExternalDataProcessor>

src/ExternalDataProcessors/Postgres/Forms/Форма/Module.bsl
&НаКлиенте
Процедура РазмерТаблиц(Команда)
	РазмерТаблицНаСервере();
КонецПроцедуры

&НаСервере
Процедура РазмерТаблицНаСервере()
	Connection = ПодключениеКПостгре();

	НаборЗаписей = Новый ComObject("ADODB.RecordSet");
	Команда = Новый COMОбъект("ADODB.Command");
	
		Команда.ActiveConnection = Connection;
		Команда.CommandText = ПолучитьТекстЗапросРазмераТаблица();
		НаборЗаписей = Команда.Execute();
	

	ВременнаяТаблица = Новый ТаблицаЗначений;

//Добавление колонок во временную таблицу
	Для НомерСтолбца = 0 По НаборЗаписей.Fields.Count - 1 Цикл
		ИмяСтолбца = НаборЗаписей.Fields.Item(НомерСтолбца).Name;
		ВременнаяТаблица.Колонки.Добавить(ИмяСтолбца);
	КонецЦикла;

	Пока Не НаборЗаписей.EOF Цикл        
		
	// Заполнение временной таблицы таблицы                 
		НоваяСтрока = ВременнаяТаблица.Добавить();
		Для НомерСтолбца = 0 По НаборЗаписей.Fields.Count - 1 Цикл
			НоваяСтрока.Установить(НомерСтолбца, СокрЛП(НаборЗаписей.Fields(НомерСтолбца).Value));
		КонецЦикла;

		НаборЗаписей.MoveNext();

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПодключениеКПостгре()
	Connection = Новый COMОбъект("ADODB.CONNECTION");
	Connection.Provider	= "MSDASQL.1";
	Connection.ConnectionString = "Driver={PostgreSQL Unicode};data source=Postgre1;Server=" + Объект.Сервер + ";Port="
		+ Объект.Порт + ";Database=" + Объект.База + ";Uid=" + Объект.Пользователь + ";Pwd=" + Объект.Пароль + ";STMT="
		+ "utf8";

	Connection.open();
	Возврат Connection;
КонецФункции

Функция ПолучитьТекстЗапросРазмераТаблица()
Возврат "SELECT 
  	|  relname AS ""table_name"", 
  	| relpages AS ""size_in_pages""
	|FROM 
 	|   pg_class"; 
КонецФункции
